import "./Categories.css";
import CategoryCard from "./CategoryCard";

const Categories = () => {
  const categoryCardData = {
    eco: `Екопътеките са интерактивни туристически маршрути.Те обикновено са кратки – преминават се за около 2 – 3 часа и
    често са кръгови. Задължително изискване са табелите с информация за всичко интересно, което може да се види наоколо – пейзажи,
    растения, животни и природни забележителности.`,
    peak: `България разполага с голямо разнообразие от върхове. Някой от тях не изискват особено голяма подготовка и могат да бъдат
    изкачени от малки и големи, други обаче представляват по-голямо предизвикателство да бъдат покорени. В каталога с върхове можете
    да откриете подходящия за вас връх.`,
    hut: `По планините в България са изградени много хижи, които осигуряват на туристите условия за отдих и нощувка.Често хижи в
    отдалечени райони нямат персонал, въпреки че на планинари е разрешен достъп до тях. Тук ще откриете богат избор от хижи, в които
    можете да пренощувате след дълъг и уморителен преход.`,
    camp: `Къмпингът е форма на туризъм, при която се нощува сред природата, в палатки или каравани. Примитивните къмпинги може да не
    предлагат никакви удобства, а само място за палатка. В добре оборудваните къмпинги има душове, прекарано електричество, паркинг,
    тоалетни и други.`,
  };
  return (
    <div className="categories">
      <CategoryCard title="Към екопътеки" content={categoryCardData.eco} />
      <CategoryCard title="Към върхове" content={categoryCardData.peak} />
      <CategoryCard title="Към хижи" content={categoryCardData.hut} />
      <CategoryCard title="Към къмпинги" content={categoryCardData.camp} />
    </div>
  );
};

export default Categories;
